veneno-529/RIOT/cpu/stm32/stmclk/stmclk_h7.c
/*
 * Copyright (c) 2024 Prime Controls, Inc.(R)
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup     cpu_stm32
 * @{
 *
 * @file
 * @brief       Implementation of STM32 clock configuration for H7 family
 *
 * @author      Joshua DeWeese <jdeweese@primecontrols.com>
 * @}
 */

#include "cpu.h"
#include "stmclk.h"
#include "clk_conf.h"
#include "periph_conf.h"
#include "periph/gpio.h"

/* PLL1 configuration */
#if IS_ACTIVE(CONFIG_USE_HSE_PLL)
#define PLL1_SRC                     RCC_PLLCKSELR_PLLSRC_HSE
#elif IS_ACTIVE(CONFIG_USE_CSI_PLL)
#define PLL1_SRC                     RCC_PLLCKSELR_PLLSRC_CSI
#else
#define PLL1_SRC                     RCC_PLLCKSELR_PLLSRC_HSI
#endif

//TODO use IS_ACTIVE() instead
/* I2S clock source below implementation for F7 but it's same for H7 */
// #ifndef CONFIG_PLLI2S_SRC
// #define CONFIG_PLLI2S_SRC           (0)     /* PLLI2S used as I2S clock source */
// #else
// #define CONFIG_PLLI2S_SRC           (1)     /* Use external I2S source */
// #endif

/* Compute the bitfields for the PLL1 configuration */
#define PLL1_M                       ((CONFIG_CLOCK_PLL1_M) << RCC_PLLCKSELR_DIVM1_Pos)
#define PLL1_N                       ((CONFIG_CLOCK_PLL1_N - 1) << RCC_PLL1DIVR_N1_Pos)
#define PLL1_P                       ((CONFIG_CLOCK_PLL1_P - 1) << RCC_PLL1DIVR_P1_Pos)
#define PLL1_Q                       ((CONFIG_CLOCK_PLL1_Q - 1) << RCC_PLL1DIVR_Q1_Pos)
#define PLL1_R                       ((CONFIG_CLOCK_PLL1_R - 1) << RCC_PLL1DIVR_R1_Pos)

/* Select 48MHz clock source between PLL1_Q or PLL3_Q. This depends on 
   the PLL parameters and if not possible on CPU lines which can provide 48MHz
   from HSI48 */

/* Determine if PLL is required, even if not used as SYSCLK
   This is the case when USB/SDMMC is used in application and PLL1_Q/PLL3_Q is
   configured to output 48MHz */
   /* Figure out where MODULE_PERIPH_USBDEV_CLK is defined */
#if (IS_USED(MODULE_PERIPH_USBDEV_CLK) || IS_USED(MODULE_PERIPH_SDMMC_CLK)) && \ 
    (CLOCK_PLL1_Q_OUT == MHZ(48))
#define CLOCK_REQUIRE_PLL1_Q          1 
#else 
#define CLOCK_REQUIRE_PLL1_Q          0
#endif

#if (defined(CPU_LINE_STM32H753XX)) && (IS_USED(MODULE_PERIPH_USBDEV_CLK)) && \
    (!IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q) && (CLOCK_PLL3_Q_OUT == MHZ(48))) 
#define CLOCK_REQUIRE_PLL3_Q          1
#else
#define CLOCK_REQUIRE_PLL3_Q          0
#endif

#if (defined(CPU_LINE_STM32H753XX)) && (IS_USED(MODULE_PERIPH_SDMMC_CLK)) && \
    (!IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q))
#define CLOCK_REQUIRE_PLL2_R          1
#else
#define CLOCK_REQUIRE_PLL2_R          0
#endif

/*PLL1_Q & PLL3_Q for USB_CLK MUX can only be used for STM32H753ZI 
  Check for other series. 
* HSI48 is only enabled if no suitbale 48MHz clock source can be generated 
  with PLL1_Q / PLL3_Q for USBDEV OR RNG
*/
#if (defined(CPU_LINE_STM32H753XX)) && (IS_USED(MODULE_PERIPH_USBDEV_CLK)) && \
    (!IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q)) && (!IS_ACTIVE(CLOCK_REQUIRE_PLL3_Q))
#define CLOCK_REQUIRE_HSI48           1
/* Disable HSI48 if USBDEV or RNG PERIPH is not used */
#elif (!IS_USED(MODULE_PERIPH_USBDEV_CLK)) 
#define CLOCK_REQUIRE_HSI48           0
#endif

#if (IS_USED(MODULE_PERIPH_USBDEV_CLK)) && !(IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q) || \
     IS_ACTIVE(CLOCK_REQUIRE_PLL3_Q) || IS_ACTIVE(CLOCK_REQUIRE_HSI48))
#error No suitable 48MHz found, USB will not work
#endif

/* THIS ASSUMES THAT SDMMC NEEDS 48MHZ datasheet has multiple option check again later */
#if (IS_USED(MODULE_SDMMC_CLK)) && !(IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q) || \
     IS_ACTIVE(CLOCK_REQUIRE_PLL2_R))   
#error No suitable 48MHz found, SDMMC will not work
#endif

/* LTDC uses PLL3_R CLOCK in case of STM32H753ZI */
/*
#if IS_USED(MODULE_PERIPH_LTDC)
#define CLOCK_REQUIRE_AXI      1
#else
#define CLOCK_REQUIRE_AXI      0
#endif
*/

/* PLL3 CONFIGURATION */
#if defined(RCC_PLLCKSELR_DIVM3_Pos)
#define PLL3_M                       ((CONFIG_CLOCK_PLL3_M) << RCC_PLLCKSELR_DIVM3_Pos)
#else
#define PLL3_M                       (0)
#endif
#if defined(RCC_PLL3DIVR_N3_Pos)
#define PLL3_N                       ((CONFIG_CLOCK_PLL3_N - 1) << RCC_PLL3DIVR_N3_Pos)
#else
#define PLL3_N                       (0)
#endif
#if defined(RCC_PLL3DIVR_P3_Pos)
#define PLL3_P                       ((CONFIG_CLOCK_PLL3_P - 1) << RCC_PLL3DIVR_P3_Pos)
#else
#define PLL3_P                       (0)
#endif
#if defined(RCC_PLL3DIVR_Q3_Pos)
#define PLL3_Q                       ((CONFIG_CLOCK_PLL3_Q - 1) << RCC_PLL3DIVR_Q3_Pos)
#else
#define PLL3_Q                       (0)
#endif
#if defined(RCC_PLL3DIVR_R3_Pos)
#define PLL3_R                       ((CONFIG_CLOCK_PLL3_R - 1) << RCC_PLL3DIVR_R3_Pos)
#else
#define PLL3_R                       (0)
#endif

/* PLL2 CONFIGURATION*/
#if defined(RCC_PLLCKSELR_DIVM2_Pos)
#define PLL2_M                       ((CONFIG_CLOCK_PLL2_M) << RCC_PLLCKSELR_DIVM2_Pos)
#else
#define PLL2_M                       (0)
#endif
#if defined(RCC_PLL2DIVR_N2_Pos)
#define PLL2_N                       ((CONFIG_CLOCK_PLL2_N - 1) << RCC_PLL2DIVR_N2_Pos)
#else
#define PLL2_N                       (0)
#endif
#if defined(RCC_PLL2DIVR_P2_Pos)
#define PLL2_P                       ((CONFIG_CLOCK_PLL2_P - 1) << RCC_PLL2DIVR_P2_Pos)
#else
#define PLL2_P                       (0)
#endif
#if defined(RCC_PLL2DIVR_Q2_Pos)
#define PLL2_Q                       ((CONFIG_CLOCK_PLL2_Q - 1) << RCC_PLL2DIVR_Q2_Pos)
#else
#define PLL2_Q                       (0)
#endif
#if defined(RCC_PLL2DIVR_R2_Pos)
#define PLL2_R                       ((CONFIG_CLOCK_PLL2_R - 1) << RCC_PLL2DIVR_R2_Pos)
#else
#define PLL2_R                       (0)
#endif

/* Configure HLCK and PCLK prescalers */
#define CLOCK_AHB_DIV               (RCC_D1CFGR_HPRE_DIV2) /* Default AHB prescaler */

#if CONFIG_CLOCK_APB1_DIV == 1
#define CLOCK_APB1_DIV              (RCC_D2CFGR_D2PPRE1_DIV1)
#elif CONFIG_CLOCK_APB1_DIV == 2
#define CLOCK_APB1_DIV              (RCC_D2CFGR_D2PPRE1_DIV2)
#elif CONFIG_CLOCK_APB1_DIV == 4
#define CLOCK_APB1_DIV              (RCC_D2CFGR_D2PPRE1_DIV4)
#elif CONFIG_CLOCK_APB1_DIV == 8
#define CLOCK_APB1_DIV              (RCC_D2CFGR_D2PPRE1_DIV8)
#elif CONFIG_CLOCK_APB1_DIV == 16
#define CLOCK_APB1_DIV              (RCC_D2CFGR_D2PPRE1_DIV16)
#else
#error "Invalid APB1 prescaler value (only 1, 2, 4, 8 and 16 allowed)"
#endif

#if CONFIG_CLOCK_APB2_DIV == 1
#define CLOCK_APB2_DIV              (RCC_D2CFGR_D2PPRE2_DIV1)
#elif CONFIG_CLOCK_APB2_DIV == 2
#define CLOCK_APB2_DIV              (RCC_D2CFGR_D2PPRE2_DIV2)
#elif CONFIG_CLOCK_APB2_DIV == 4
#define CLOCK_APB2_DIV              (RCC_D2CFGR_D2PPRE2_DIV4)
#elif CONFIG_CLOCK_APB2_DIV == 8
#define CLOCK_APB2_DIV              (RCC_D2CFGR_D2PPRE2_DIV8)
#elif CONFIG_CLOCK_APB2_DIV == 16
#define CLOCK_APB2_DIV              (RCC_D2CFGR_D2PPRE2_DIV16)
#else
#error "Invalid APB2 prescaler value (only 1, 2, 4, 8 and 16 allowed)"
#endif

#if CONFIG_CLOCK_APB3_DIV == 1
#define CLOCK_APB3_DIV              (RCC_D1CFGR_D1PPRE_DIV1)
#elif CONFIG_CLOCK_APB3_DIV == 2
#define CLOCK_APB3_DIV              (RCC_D1CFGR_D1PPRE_DIV2)
#elif CONFIG_CLOCK_APB3_DIV == 4
#define CLOCK_APB3_DIV              (RCC_D1CFGR_D1PPRE_DIV4)
#elif CONFIG_CLOCK_APB3_DIV == 8
#define CLOCK_APB3_DIV              (RCC_D1CFGR_D1PPRE_DIV8)
#elif CONFIG_CLOCK_APB3_DIV == 16
#define CLOCK_APB3_DIV              (RCC_D1CFGR_D1PPRE_DIV16)
#else
#error "Invalid APB3 prescaler value (only 1, 2, 4, 8 and 16 allowed)"
#endif

