veneno-529/RIOT/cpu/stm32/stmclk/stmclk_h7.c
#if CONFIG_CLOCK_APB4_DIV == 1
#define CLOCK_APB4_DIV              (RCC_D3CFGR_D3PPRE_DIV1)
#elif CONFIG_CLOCK_APB4_DIV == 2
#define CLOCK_APB4_DIV              (RCC_D3CFGR_D3PPRE_DIV2)
#elif CONFIG_CLOCK_APB4_DIV == 4
#define CLOCK_APB4_DIV              (RCC_D3CFGR_D3PPRE_DIV4)
#elif CONFIG_CLOCK_APB4_DIV == 8
#define CLOCK_APB4_DIV              (RCC_D3CFGR_D3PPRE_DIV8)
#elif CONFIG_CLOCK_APB4_DIV == 16
#define CLOCK_APB4_DIV              (RCC_D3CFGR_D3PPRE_DIV16)
#else
#error "Invalid APB4 prescaler value (only 1, 2, 4, 8 and 16 allowed)"
#endif

/* Deduct the needed flash wait states from the core clock frequency */
#define FLASH_WAITSTATES            (CLOCK_CORECLOCK / 30000000U)
/* we enable I+D cashes, pre-fetch, and we set the actual number of
 * needed flash wait states */
#if defined(CPU_FAM_STM32F2) || defined(CPU_FAM_STM32F4)
#define FLASH_ACR_CONFIG            (FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_PRFTEN | FLASH_WAITSTATES)
#elif defined(CPU_FAM_STM32F7)
#define FLASH_ACR_CONFIG            (FLASH_ACR_ARTEN | FLASH_ACR_PRFTEN | FLASH_WAITSTATES)
#elif defined(CPU_FAM_STM32H7)
#define FLASH_ACR_CONFIG            (0) /* VERIFY THIS LATER */
#endif

/* Default is not configure MCO1 */
#ifndef CONFIG_CLOCK_ENABLE_MCO1
#define CONFIG_CLOCK_ENABLE_MCO1    0
#endif

#if !defined(RCC_CFGR_MCO1) && IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1)
#error "stmclk: no MCO1 on this device"
#endif

/* Configure the MCO1 clock source: options are PLL (default), HSE, LSE, HSI48 or HSI */
#ifndef CONFIG_CLOCK_MCO1_USE_PLL1_Q
#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48)
#define CONFIG_CLOCK_MCO1_USE_PLL1_Q   0
#else
#define CONFIG_CLOCK_MCO1_USE_PLL1_Q  1     /* Use PLL1_Q output by default */
#endif
#endif /* CONFIG_CLOCK_MCO1_USE_PLL1 */

#ifndef CONFIG_CLOCK_MCO1_USE_HSE
#define CONFIG_CLOCK_MCO1_USE_HSE   0
#endif /* CONFIG_CLOCK_MCO1_USE_HSE */

#ifndef CONFIG_CLOCK_MCO1_USE_HSI
#define CONFIG_CLOCK_MCO1_USE_HSI   0
#endif /* CONFIG_CLOCK_MCO1_USE_HSI */

#ifndef CONFIG_CLOCK_MCO1_USE_LSE
#define CONFIG_CLOCK_MCO1_USE_LSE   0
#endif /* CONFIG_CLOCK_MCO1_USE_HSI */

#ifndef CONFIG_CLOCK_MCO1_USE_HSI48
#define CONFIG_CLOCK_MCO1_USE_HSI48   0
#endif /* CONFIG_CLOCK_MCO1_USE_HSI */

#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48))
#error "Cannot use PLL1_Q as MCO1 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48))
#error "Cannot use HSE as MCO1 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48))
#error "Cannot use HSI as MCO1 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48))
#error "Cannot use LSE as MCO1 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE))
#error "Cannot use HSI48 as MCO1 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q)
#define CLOCK_MCO1_SRC                          (RCC_CFGR_MCO1_1 | RCC_CFGR_MCO1_0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE)
#define CLOCK_MCO1_SRC                          (RCC_CFGR_MCO1_1)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI)
#define CLOCK_MCO1_SRC                          (0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE)
#define CLOCK_MCO1_SRC                          (RCC_CFGR_MCO1_0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48)
#define CLOCK_MCO1_SRC                          (RCC_CFGR_MCO1_2)   
#else
#error "Invalid MCO1 clock source selection"
#endif

/* Configure the MCO1 prescaler: options are 1 to 5 */
#ifndef CONFIG_CLOCK_MCO1_PRE
#define CONFIG_CLOCK_MCO1_PRE           (1)
#endif

#if (CONFIG_CLOCK_MCO1_PRE >= 1) && (CONFIG_CLOCK_MCO1_PRE <= 16)
#define CLOCK_MCO1_PRE  (((CONFIG_CLOCK_MCO1_PRE - 1) & 0xF) << RCC_CFGR_MCO1PRE_Pos)
#else
#error "Invalid MCO1 prescaler"
#endif


/* Default is not configure MCO2 */
#ifndef CONFIG_CLOCK_ENABLE_MCO2
#define CONFIG_CLOCK_ENABLE_MCO2        0
#endif

#if !defined(RCC_CFGR_MCO2) && IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2)
#error "stmclk: no MCO2 on this device"
#endif

/* Configure the MCO1 clock source: options are PLL1_P (default),PLL2_P, SYSCLK, LSI, CSI or HSE */
#ifndef CONFIG_CLOCK_MCO2_USE_PLL1_P
#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK)
#define CONFIG_CLOCK_MCO2_USE_PLL1_P   0
#else
#define CONFIG_CLOCK_MCO2_USE_PLL1_P   1     /* Use PLL by default */
#endif
#endif /* CONFIG_CLOCK_MCO2_USE_PLL1 */

#ifndef CONFIG_CLOCK_MCO2_USE_PLL2_Q
#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK)
#define CONFIG_CLOCK_MCO2_USE_PLL2   0
#else
#define CONFIG_CLOCK_MCO2_USE_PLL2_P   1     /* Use PLL by default */
#endif
#endif /* CONFIG_CLOCK_MCO2_USE_PLL2 */

#ifndef CONFIG_CLOCK_MCO2_USE_HSE
#define CONFIG_CLOCK_MCO2_USE_HSE   0
#endif /* CONFIG_CLOCK_MCO2_USE_HSE */

#ifndef CONFIG_CLOCK_MCO2_USE_LSI
#define CONFIG_CLOCK_MCO2_USE_LSI   0
#endif /* CONFIG_CLOCK_MCO2_USE_HSI */

#ifndef CONFIG_CLOCK_MCO2_USE_CSI
#define CONFIG_CLOCK_MCO2_USE_CSI   0
#endif /* CONFIG_CLOCK_MCO2_USE_HSI */

#ifndef CONFIG_CLOCK_MCO2_USE_SYSCLK
#define CONFIG_CLOCK_MCO2_USE_SYSCLK   0
#endif /* CONFIG_CLOCK_MCO2_USE_SYSCLK */


