veneno-529/RIOT/cpu/stm32/stmclk/stmclk_h7.c
#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use PLL1_P as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use HSE as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use CSI as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use LSI as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use PLL2_P as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P))
#error "Cannot use SYSCLK as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK)
#define CLOCK_MCO2_SRC                          (0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_0) 
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_1)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_1 | RCC_CFGR_MCO2_0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_2)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_2 | RCC_CFGR_MCO2_0)
#else
#error "Invalid MCO2 clock source selection"
#endif

/* Configure the MCO1 prescaler: options are 1 to 5 */
#ifndef CONFIG_CLOCK_MCO2_PRE
#define CONFIG_CLOCK_MCO2_PRE           (1)
#endif

#if (CONFIG_CLOCK_MCO2_PRE >= 1) && (CONFIG_CLOCK_MCO2_PRE <= 16)
#define CLOCK_MCO2_PRE  (((CONFIG_CLOCK_MCO2_PRE - 1) & 0xF) << RCC_CFGR_MCO2PRE_Pos)
#else
#error "Invalid MCO2 prescaler"
#endif

/* Check whether PLL1 must be enabled:
  - When PLL1 is used as SYSCLK
  - When PLL1 is required (PLL1_P/PLL1_Q/PLL1R)
  - When PLL1_P is used as input source for MCO1 or MCO2
*/
#if IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
    IS_ACTIVE(CONFIG_USE_CSI_PLL) || (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P)) 
#define CLOCK_ENABLE_PLL1_P               1
#else
#define CLOCK_ENABLE_PLL1_P               0
#endif

#if IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
    IS_ACTIVE(CONFIG_USE_CSI_PLL) || IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q))
#define CLOCK_ENABLE_PLL1_Q                1
#else
#define CLOCK_ENABLE_PLL1_Q                0
#endif


/* Check whether PLL2 must be enabled:
  - When PLL2 is required (PLL2_P/PLL2_Q/PLL2_R)
  - When PLL2 is used as input source for MCO1 or MCO2
*/
#if IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
    IS_ACTIVE(CONFIG_USE_CSI_PLL) || (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P))
#define CLOCK_ENABLE_PLL2_P                1
#else
#define CLOCK_ENABLE_PLL2_P                0
#endif

#if IS_ACTIVE(CLOCK_REQUIRE_PLL2_R)
#define CLOCK_ENABLE_PLL2_R                1
#else
#define CLOCK_ENABLE_PLL2_R                0
#endif

/* Check whether PLL3 must be enabled :
  - When PLL3 is required*/
#if  IS_ACTIVE(CLOCK_REQUIRE_PLL3_Q)
#define CLOCK_ENABLE_PLL3_Q                1
#else
#define CLOCK_ENABLE_PLL3_Q                0
#endif

/* Check whether HSE must be enabled:
  - When HSE is used as SYSCLK
  - When PLL1 is used as SYSCLK and the board provides HSE (since HSE will be
    used as PLL1 input clock)
  - When HSE is used input source for MCO1 or MCO2
*/
#if IS_ACTIVE(CONFIG_USE_HSE_PLL) || IS_ACTIVE(CONFIG_USE_HSE_DIRECT) \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE)) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE))
#define CLOCK_ENABLE_HSE                1
#else
#define CLOCK_ENABLE_HSE                0
#endif

/* Check whether HSI must be enabled:
  - When HSI is used as SYSCLK
  - When PLL1 is used as SYSCLK and the board doesn't provide HSE (since HSI will be
    used as PLL1 input clock)
  - When HSI is used input source for MCO1
*/
#if IS_ACTIVE(CONFIG_USE_HSI_DIRECT) || IS_ACTIVE(CONFIG_USE_HSI_PLL) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI))
#define CLOCK_ENABLE_HSI                1
#else
#define CLOCK_ENABLE_HSI                0
#endif

#if IS_ACTIVE(CONFIG_USE_CSI_DIRECT) || IS_ACTIVE(CONFIG_USE_CSI_PLL) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI))
#define CLOCK_ENABLE_CSI                1
#else
#define CLOCK_ENABLE_CSI                0
#endif

