veneno-529/RIOT/cpu/stm32/stmclk/stmclk_h7.c
#if IS_ACTIVE(CONFIG_USE_LSI) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI))
#define CLOCK_ENABLE_LSI                1
#else
#define CLOCK_ENABLE_LSI                0
#endif

#if IS_ACTIVE(CONFIG_USE_LSE) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE))
#define CLOCK_ENABLE_LSE                1
#else
#define CLOCK_ENABLE_LSE                0
#endif    

#if (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48)) || \
    IS_ACTIVE(CLOCK_REQUIRE_HSI48)    
#define CLOCK_ENABLE_HSI48              1
#else
#define CLOCK_ENABLE_HSI48              0

void stmclk_init_sysclk(void)
{
    /* disable any interrupts. Global interrupts could be enabled if this is
     * called from some kind of bootloader...  */
    unsigned is = irq_disable();
    RCC->CR = 0;
    RCC->CICR = 0;

    /* enable HSI clock for the duration of initialization */
    stmclk_enable_hsi();

    /* use HSI as system clock while we do any further configuration and
     * configure the AHB and APB clock dividers as configure by the board */
    RCC->D1CFGR = RCC_D1CFGR_D1CPRE_DIV1 | RCC_D1CFGR_HPRE_DIV2 | RCC_D1CFGR_D1PPRE_DIV2;
    RCC->D2CFGR = RCC_D2CFGR_D2PPRE1_DIV2 | RCC_D2CFGR_D2PPRE2_DIV2;
    RCC->D3CFGR = RCC_D3CFGR_D3PPRE_DIV4;

    /* use HSI as system clock while we do any further configuration and
     * configure the AHB and APB clock dividers as configure by the board */
    RCC->CFGR = (RCC_CFGR_SW_HSI);
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI) {}

#if 1
    /* Flash config */
    //FLASH->ACR = FLASH_ACR_CONFIG;
    FLASH->ACR = FLASH_ACR_LATENCY_3WS;

    // enable internal LDO power supply
    PWR->CR3 |= PWR_CR3_LDOEN;
    while (!(PWR->CSR1 & PWR_CSR1_ACTVOSRDY)) {}

    // set voltage sacaling to allow max clock speed
    PWR->D3CR &= ~PWR_D3CR_VOS;
    while (!(PWR->D3CR & PWR_D3CR_VOSRDY)) {}

/* Enable Over-Drive if HCLK > 168MHz on F4 or HCLK > 180MHz on F7 */
/*
#if defined(CPU_FAM_STM32F4) && defined(PWR_CR_ODEN)
    if (CLOCK_AHB > MHZ(168)) {
        PWR->CR |= PWR_CR_ODEN;
        while (!(PWR->CSR & PWR_CSR_ODRDY)) {}
        PWR->CR |= PWR_CR_ODSWEN;
        while (!(PWR->CSR & PWR_CSR_ODSWRDY)) {}
    }
#endif

#if defined(CPU_FAM_STM32F7)
    if (CLOCK_AHB > MHZ(180)) {
        PWR->CR1 |= PWR_CR1_ODEN;
        while (!(PWR->CSR1 & PWR_CSR1_ODRDY)) {}
        PWR->CR1 |= PWR_CR1_ODSWEN;
        while (!(PWR->CSR1 & PWR_CSR1_ODSWRDY)) {}
    }
#endif
*/

    /* disable all active clocks except HSI -> resets the clk configuration */
    RCC->CR = (RCC_CR_HSION | RCC_CR_HSIDIV_1);

    if (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1)) {
        RCC->CFGR |= CLOCK_MCO1_SRC | CLOCK_MCO1_PRE;

        /* Configure GPIO pin (PA8/AF0) */
        gpio_init(GPIO_PIN(PORT_A, 8), GPIO_OUT);
        gpio_init_af(GPIO_PIN(PORT_A, 8), GPIO_AF0);
    }

    if (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2)) {
        RCC->CFGR |= CLOCK_MCO2_SRC | CLOCK_MCO2_PRE;

        /* Configure GPIO pin (PC9/AF0) */
        gpio_init(GPIO_PIN(PORT_C, 9), GPIO_OUT);
        gpio_init_af(GPIO_PIN(PORT_C, 9), GPIO_AF0);
    }
#endif

    /* Enable HSE if required */
    if (IS_ACTIVE(CLOCK_ENABLE_HSE)) {
        //RCC->CR |= (RCC_CR_HSEBYP); //TODO
        RCC->CR |= (RCC_CR_HSEON);
        while (!(RCC->CR & RCC_CR_HSERDY)) {}
    }

    /* Enable LSE if required */
    if(IS_ACTIVE(CLOCK_ENABLE_LSE)) {
        RCC->BDCR |= RCC_BDCR_LSEON;
        while (!(RCC->BDCR & RCC_BDCR_LSERDY)) {}
    }

    /* Enable HSI if required */
    if(IS_ACTIVE(CLOCK_ENABLE_CSI)) {
        RCC->CR |= RCC_CR_CSION;
        while (!(RCC->CR & RCC_CR_CSIRDY)) {}
    }

    /* Enable LSI if required */ 
    if(IS_ACTIVE(CLOCK_ENABLE_LSI)) {
        RCC->CSR |= RCC_CSR_LSION;
        while (!(RCC->CSR & RCC_CSR_LSIRDY)) {}
    }

    /* Enable HSI48 if required */
    if(IS_ACTIVE(CLOCK_ENABLE_HSI48)) {
        RCC->CRRCR |= RCC_CRRCR_HSI48ON;
        while (!(RCC->CRRCR & RCC_CRRCR_HSI48RDY)) {}
    }

    /* Enable PLL if required */
    if (IS_ACTIVE(CLOCK_ENABLE_PLL1_P) || IS_ACTIVE(CLOCK_ENABLE_PLL1_Q) ||
        IS_ACTIVE(CLOCK_ENABLE_PLL2_P) || IS_ACTIVE(CLOCK_ENABLE_PLL2_R) ||
        IS_ACTIVE(CLOCK_ENABLE_PLL3_Q)) {
        //TODO set fraction to 0?
         /* now we can safely configure and start the PLL */
        RCC->PLLCKSELR = (PLL1_SRC | PLL1_M | PLL2_M | PLL3_M);
        RCC->PLLCFGR =
            ( RCC_PLLCFGR_PLL1RGE_0 // search datasheet for PLL1RGE
            //| RCC_PLLCFGR_PLL1VCOSEL
            | RCC_PLLCFGR_PLL2RGE_0 // search datasheet for PLL2RGE
            //| RCC_PLLCFGR_PLL2VCOSEL
            | RCC_PLLCFGR_PLL3RGE_0 // search datasheet for PLL3RGE
            //| RCC_PLLCFGR_PLL3VCOSEL
            // by default enabling all outputs, can be disabled later if not used
            | RCC_PLLCFGR_DIVP1EN
            | RCC_PLLCFGR_DIVQ1EN
            | RCC_PLLCFGR_DIVR1EN
            | RCC_PLLCFGR_DIVP2EN
            | RCC_PLLCFGR_DIVQ2EN 
            | RCC_PLLCFGR_DIVR2EN
            | RCC_PLLCFGR_DIVP3EN
            | RCC_PLLCFGR_DIVQ3EN
            | RCC_PLLCFGR_DIVR3EN
            );
        //RCC->PLL1FRACEN = 0;
        //RCC->PLL1FRACR |= RCC_PLL1FRACR_FRACN1;
        RCC->PLL1DIVR = (PLL1_N | PLL1_P | PLL1_Q | PLL1_R);
        RCC->CR |= RCC_CR_PLL1ON;
        while (!(RCC->CR & RCC_CR_PLL1RDY)) {}
        RCC->PLL2DIVR = (PLL2_N | PLL2_P | PLL2_Q | PLL2_R);
        RCC->CR |= RCC_CR_PLL2ON;
        while (!(RCC->CR & RCC_CR_PLL2RDY)) {} 
        RCC->PLL3DIVR = (PLL3_N | PLL3_P | PLL3_Q | PLL3_R);
        RCC->CR |= RCC_CR_PLL3ON;
        while (!(RCC->CR & RCC_CR_PLL3RDY)) {}
        // RCC->CR |= (RCC_CR_PLLON);
        // while (!(RCC->CR & RCC_CR_PLLRDY)) {}
    }

    /* Configure SYSCLK */
    if (IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) ||
             IS_ACTIVE(CONFIG_USE_CSI_PLL)) {
        /* Enable PLL1P as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_PLL1);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL1) {}
    }
    else if (IS_ACTIVE(CONFIG_USE_HSI DIRECT)) {
        /* Enable HSI as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_HSI);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI) {}
    }
    else if (IS_ACTIVE(CONFIG_USE_HSE_DIRECT)) {
        /* Enable HSE as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_HSE);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE) {}
    }
    else if (IS_ACTIVE(CONFIG_USE_CSI_DIRECT)) {
        /* Enable CSI as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_CSI);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_CSI) {}
    }
    else {
        /* Should not happen */
        while (1);
    }

//while(1);

#if 0
    if (!IS_ACTIVE(CLOCK_ENABLE_HSI)) {
        /* Disable HSI only if not used */
        stmclk_disable_hsi();
    }

#if defined(RCC_CR_PLLI2SON)
    if (IS_ACTIVE(CLOCK_ENABLE_PLLI2S)) {
        RCC->PLLI2SCFGR = (CONFIG_PLLI2S_SRC | PLLI2S_M | PLLI2S_N | PLLI2S_P | PLLI2S_Q | PLLI2S_R);
        RCC->CR |= (RCC_CR_PLLI2SON);
        while (!(RCC->CR & RCC_CR_PLLI2SRDY)) {}
    }
#endif

#if defined(RCC_DCKCFGR1_PLLSAIDIVR)
    if (IS_USED(MODULE_PERIPH_LTDC)) {
        RCC->DCKCFGR1 &= ~RCC_DCKCFGR1_PLLSAIDIVR;
        RCC->DCKCFGR1 |= RCC_DCKCFGR1_PLLSAIDIVR_0; /* Divide by 4 */
    }
#endif

#if defined(RCC_DCKCFGR_PLLSAIDIVR)
    if (IS_USED(MODULE_PERIPH_LTDC)) {
        RCC->DCKCFGR &= ~RCC_DCKCFGR_PLLSAIDIVR;
        RCC->DCKCFGR |= RCC_DCKCFGR_PLLSAIDIVR_0; /* Divide by 4 */
    }
#endif

#if defined(RCC_CR_PLLSAION)
    if (IS_ACTIVE(CLOCK_ENABLE_PLLSAI)) {
        RCC->PLLSAICFGR = (PLLSAI_M | PLLSAI_N | PLLSAI_P | PLLSAI_Q | PLLSAI_R);
        RCC->CR |= (RCC_CR_PLLSAION);
        while (!(RCC->CR & RCC_CR_PLLSAIRDY)) {}
    }
#endif

#if defined(RCC_DCKCFGR2_CK48MSEL)
    if (IS_ACTIVE(CLOCK_ENABLE_PLLI2S) || IS_ACTIVE(CLOCK_ENABLE_PLLSAI)) {
        /* Use PLLSAI_P or PLLI2S_Q clock source */
        RCC->DCKCFGR2 |= RCC_DCKCFGR2_CK48MSEL;
    }
#endif
#endif

    irq_restore(is);
}
